chirags98/Edge_ML_STM32N6/projects/STM32CubeN6/Projects/STM32N6570-DK/Templates/Template_FSBL_XIP/Appli/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "isp_api.h"
#include "imx335_E27_isp_param_conf.h"
#include "imx335.h"
#include "stm32n6570_discovery_xspi.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define CAMERA_IMX335_ADDRESS 0x34U
#define FRAME_WIDTH        640
#define FRAME_HEIGHT       480
#define FRAME_BUFFER_SIZE  (FRAME_WIDTH * FRAME_HEIGHT * 2)   /* RGB565 = 2 bytes/pixel */
#define BUFFER_ADDRESS     0x90000000UL /* PSRAM (XSPI1), not AXISRAM */

#define DIV_FACTOR(SRC, DST) (((uint32_t)((1024 * DST) / SRC)) > 1023 ? 1023 : ((uint32_t)((1024 * DST) / SRC)))
#define DOWNSCALE_RATIO(SRC, DST) (((uint32_t)(((float_t)(SRC) / (float_t)(DST)) * 8192) < 8192) ? 8192 : \
                                   ((((uint32_t)(((float_t)(SRC) / (float_t)(DST)) * 8192)) > 65535) ? 65535 : \
                                   ((uint32_t)(((float_t)(SRC) / (float_t)(DST)) * 8192))))
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

DCMIPP_HandleTypeDef hdcmipp;

I2C_HandleTypeDef hi2c1;

LTDC_HandleTypeDef hltdc;

RAMCFG_HandleTypeDef hramcfg_SRAM3;
RAMCFG_HandleTypeDef hramcfg_SRAM4;

XSPI_HandleTypeDef hxspi1;

/* USER CODE BEGIN PV */
static IMX335_Object_t IMX335Obj;
static int32_t isp_gain;
static int32_t isp_exposure;
ISP_HandleTypeDef hcamera_isp;

volatile uint32_t dbg_frame_count;
volatile uint32_t dbg_vsync_count;

volatile int32_t  dbg_readid_ret;
volatile uint32_t dbg_id;
volatile int32_t  dbg_imx335_init_ret;
volatile int32_t  dbg_setfreq_ret;
volatile int32_t  dbg_isp_init_ret;
volatile int32_t  dbg_pipe_start_ret;
volatile uint32_t dbg_i2c_err;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_LTDC_Init(void);
static void MX_DCMIPP_Init(void);
static void MX_I2C1_Init(void);
static void MX_RAMCFG_Init(void);
static void MX_XSPI1_Init(void);
static void SystemIsolation_Config(void);
/* USER CODE BEGIN PFP */
static int32_t YourI2C1_Init(void);
static int32_t YourI2C1_DeInit(void);
static int32_t YourI2C1_WriteReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length);
static int32_t YourI2C1_ReadReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length);
static int32_t YourI2C1_GetTick(void);

static ISP_StatusTypeDef GetSensorInfoHelper(uint32_t Instance, ISP_SensorInfoTypeDef *SensorInfo);
static ISP_StatusTypeDef SetSensorGainHelper(uint32_t Instance, int32_t Gain);
static ISP_StatusTypeDef GetSensorGainHelper(uint32_t Instance, int32_t *Gain);
static ISP_StatusTypeDef SetSensorExposureHelper(uint32_t Instance, int32_t Exposure);
static ISP_StatusTypeDef GetSensorExposureHelper(uint32_t Instance, int32_t *Exposure);
void Error_Handler(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* System clock already configured, simply SystemCoreClock init */
  SystemCoreClockUpdate();
  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

  /* USER CODE BEGIN Init */
  /* Initialize LED1 */
  BSP_LED_Init(LED_GREEN);
  /* USER CODE END Init */

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_LTDC_Init();
  MX_DCMIPP_Init();
  MX_I2C1_Init();
  MX_RAMCFG_Init();
  SystemIsolation_Config();
  /* USER CODE BEGIN 2 */

  /* PSRAM: do not call BSP_XSPI_RAM_Init() — its MSP resets XSPIM and kills XIP. */
  {
    MX_XSPI_InitTypeDef xspi_init = {0};
    volatile uint32_t *psram;

    xspi_init.ClockPrescaler = 3;
    xspi_init.MemorySize     = HAL_XSPI_SIZE_256MB;
    xspi_init.SampleShifting = HAL_XSPI_SAMPLE_SHIFT_NONE;

    if (MX_XSPI_RAM_Init(&hxspi_ram[0], &xspi_init) != HAL_OK)
    {
      Error_Handler();
    }

    (void)APS256XX_WriteReg(&hxspi_ram[0], 0, 0x30); /* read latency  */
    (void)APS256XX_WriteReg(&hxspi_ram[0], 4, 0x20); /* write latency */
    (void)APS256XX_WriteReg(&hxspi_ram[0], 8, 0x40); /* x16 mode      */
    (void)HAL_XSPI_SetClockPrescaler(&hxspi_ram[0], 0);

    if (BSP_XSPI_RAM_EnableMemoryMappedMode(0) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    psram = (volatile uint32_t *)BUFFER_ADDRESS;
    psram[0] = 0xA5A5A5A5UL;
    psram[1] = 0x5A5A5A5AUL;
    if ((psram[0] != 0xA5A5A5A5UL) || (psram[1] != 0x5A5A5A5AUL))
    {
      Error_Handler(); /* PSRAM not mapped — do not start the camera */
    }
  }

  HAL_GPIO_WritePin(NRST_GPIO_Port, NRST_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(PWR_EN_GPIO_Port, PWR_EN_Pin, GPIO_PIN_RESET);
  HAL_Delay(200);
  HAL_GPIO_WritePin(PWR_EN_GPIO_Port, PWR_EN_Pin, GPIO_PIN_SET);
  HAL_Delay(3);

